
### Configuring Defualt Static Routes

In the figure, R1 could be configured with three static routes, one to reach each of the remote networks in the example topology. However, R1 is a stub router because it is only connected to R2. Therefore, it would be more efficient to configure a single default static route.

![[Pasted image 20220128100242.png]]

```text
R1(config)# ip route 0.0.0.0 0.0.0.0 172.16.2.2
```

```text
R1(config)# ipv6 route ::/0 2001:db8:acad:2::2
```

---
### Verify IPv4 Default Static Route

```text
R1# show ip route static
```

```text
R1# show ipv6 route static
``````